<!doctype html>
<html lang="en">
<head>
<title>oerinfra1-2</title>
<meta name="generator" content="Etherpad">
<meta name="author" content="Etherpad">
<meta name="changedby" content="Etherpad">
<meta charset="utf-8">
<style>
ol {
  counter-reset: item;
}

ol > li {
  counter-increment: item;
}

ol ol > li {
  display: block;
}

ol > li {
  display: block;
}

ol > li:before {
  content: counters(item, ".") ". ";
}

ol ol > li:before {
  content: counters(item, ".") ". ";
  margin-left: -20px;
}

ul.indent {
  list-style-type: none;
}

img{max-width:100%}h1{font-size: 2.5em;}
h2{font-size: 1.8em;}
h3{font-size: 1.5em;}
h4{font-size: 1.2em;}
code{font-family: RobotoMono;}

</style>
</head>
<body>
<h1>Dokumentation Session 1-2</h1><br><h3>11:00-11:45 --- Raum 44.22</h3><br><br>Thema: OER produktion<br><br>Erfahrungsbericht Klagenfurt (Nina Lobnig):<br><ul class="indent"><li>&nbsp;&nbsp;&nbsp; eInformatics@Austria&nbsp;<ul class="indent"><li>produktion von interaktiven videos (H5P), in youtube nicht sichtbar, erst in Moodle</li><li>teaser video am Anfang (hast du dir schonmal &#252;berlegt?), animierte charaktere</li></ul></li></ul>Projektziel eInformatics: Kurse f&#252;r SQL, wie macht man Datenbank, selbstlernkurs, ver&#246;ffentlichung auf iMooX<br><br>H5P videos: welcher Part ist der H5P?<br><ul class="indent"><li>interaktives Buch (kompliziert f&#252;r Kinder und Sch&#252;ler)</li><li>mehr mit kleinen Spots mit zwischenfragen (Miniquiz), was ist im Video vorgekommen?</ul><br>Was ist H5P?<br><ul class="indent"><li>Moodle verwendet es f&#252;r interaktive aktionen, bietet mehr als features als normales moodle quiz</li><li>&quot;overlay&quot; zum video, video kann gestopt werden f&#252;r die interaktion</li><li>viele LMS verwenden es</li></ul>Erfahrungen diskussion:<br><ul class="indent"><li>&nbsp;&nbsp;&nbsp; Leuten fehlt die zeit f&#252;r MOOCs, k&#246;dern mit f&#246;derungen&#x2F;unterst&#252;tzung. Fehlende resourcen</li><li>Gibt immer wieder f&#246;rdert&#246;pfe in der lehre, dann kommen leute mit ideen</li><li>teils interne leistungsverechnungen gel&#246;st</li><li>TU Graz gro&#223;es video team begleitet die erstellung</li><li>Regelm&#228;&#223;ige f&#246;rderungen werden ausgeschrieben</li><li>&#214;sterreich und die EU, wo personen des &#246;ffentliches interesses mitwirken schaltet sich das land&#x2F;bund auch ein</li></ul>FH h&#228;ngt sich oft an andere institute (internationale management), wo auschreibungen gestaltet werden<br>Wie werden stellen finanziert?<br>Teils teils, teils &#252;ber projekt<br>Knappes budget, gerade genug f&#252;r die projekte<br><br>Projekte bringen dinge ins rollen, so werden andere auch motiviert mitzumachen<br><br>Professoren legen gro&#223;en wert auf forschung, aber wahrzunehmen des weiternutzes durch OER wird vernachl&#228;ssigt<br><br>Sorge aus rechtlicher sicht, wegen copyrights und lizenzierung auf dauer<br><br>Wenn man material bekommt kann man nicht alles durchgehen und checken ob diese lizenzfrei sind<br>man m&#252;sste bei der erstellung alles per hand durchgehen und chekcken<br><br>wie weit geht die produktion? ich mach die grafiken, animationen, ton etc..<br>wird alles selbst gemacht, software f&#252;r animation muss man sich einlesen<br>greenscreen videos werden schnell gemacht<br>schriftarten sind ein problem wegen lizenzen (auch andere lizenzen sind problematisch)<br><br>oft verwendung von schon vorhandenen videos, was problematisch ist&nbsp;<br><br>produktionslaufzeit von videos?<br>kommt auf die l&#228;nge an und welche art von material noch verwendet wird<br>mindestens 1 jahr f&#252;r einen MOOC (konzeptiert, video gedreht, texte, materialien)<br><br>Viele leute keine vorstellung wieviel zeit in so ein video geht (z.b. kurgesagt) wo alles selbst gemacht wird<br>Jedes video ca 1000-1200 arbeitsstunden (bei 3-5min video)<br><br>die meisten hier produzieren videos f&#252;rs institut&#x2F;department oder lehrende<br><br>es k&#246;nnen fertige materialien hochgeladen werden oder nur teils fertige materialien<br><br>Microsoft hat andere anspr&#252;che an technische anspr&#252;che an die ergebnisse als univesit&#228;ten<br><br><ul class="indent"><li>Session 2-2</li><li>Nina Lobnig - Universit&#228;t Klagenfurt</li><li>WIe erstellt man gut wiederverwendbare Lernobjekte?&nbsp;</li><li>- modular</li><li>- Kontexte, Verweise,&nbsp; Voraussetzungen bereiten eventuell Probleme....&nbsp; &quot;Wie im vorherigen Kapitel besprochen.....&quot;</li><li>- geeignet lizenziert</li><li>- passende Granularit&#228;t</li><li>L&#246;sung in Klagenfurt (<a href="https&#x3a;&#x2F;&#x2F;www&#x2e;aau&#x2e;at&#x2F;en&#x2F;aics&#x2F;" rel="noreferrer noopener">https:&#x2F;&#x2F;www.aau.at&#x2F;en&#x2F;aics&#x2F;</a>)</li><li>Videos auf youtube - unter einem account - sp&#228;ter versch Playlists spez. f&#252;r braching szenarien etc.</li><li>Namentliche Nennung in den VIdeos:&nbsp;</li><li>&nbsp;&nbsp;&nbsp; prim&#228;r Universit&#228;t bzw. Institut bzgl. R&#252;ckfragen</li><li>&nbsp;&nbsp;&nbsp;&nbsp;</li><li>Barrierefreiheit von Videos&nbsp;</li><li>- h5p Elemente - screen reader kompatibilit&#228;t</li><li>- Kontrast etc in Videos</li><li>- Transcript der Videos auf Youtube hochgeladen&nbsp;</li></ul><br><ul class="indent"></ul><br><br>
</body>
</html>
