<!doctype html>
<html lang="en">
<head>
<title>oerinfra4-2</title>
<meta name="generator" content="Etherpad">
<meta name="author" content="Etherpad">
<meta name="changedby" content="Etherpad">
<meta charset="utf-8">
<style>
ol {
  counter-reset: item;
}

ol > li {
  counter-increment: item;
}

ol ol > li {
  display: block;
}

ol > li {
  display: block;
}

ol > li:before {
  content: counters(item, ".") ". ";
}

ol ol > li:before {
  content: counters(item, ".") ". ";
  margin-left: -20px;
}

ul.indent {
  list-style-type: none;
}

img{max-width:100%}h1{font-size: 2.5em;}
h2{font-size: 1.8em;}
h3{font-size: 1.5em;}
h4{font-size: 1.2em;}
code{font-family: RobotoMono;}

</style>
</head>
<body>
<h1>Dokumentation Session 4-2</h1><br><h3>13:40-15:15 --- Raum 44.22</h3><br><br><strong>Nutzungsbedingungen (f&#252;r OER Repos an Unis&#x2F;Hochschulen)- Michael Raunig</strong><br><br>Begriffe:&nbsp;<br>&nbsp;&nbsp;&nbsp; UG - Uni Graz<br>&nbsp;&nbsp;&nbsp; UrhG - Urheberrechtsgesetz<br>&nbsp;&nbsp;&nbsp; OER - Open Educational Resources<br>&nbsp;&nbsp;&nbsp; UrhRecht&#x2F;UrhR - Urheberrecht<br>&nbsp;&nbsp;&nbsp; PW - Passwort<br>&nbsp;&nbsp;&nbsp; MA - Mitarbeiter*in<br>&nbsp;&nbsp;&nbsp; UW - Uni Wien&nbsp;<br><br>UG haben OER produziert und dann immer ein Papier unterschreiben lassen &quot;ich sichere der UG meine Zustimmung zu, dieses Objekt &lt;titel&gt; unter diesen und jenen Bedingungen zu ver&#246;ffentlichen [...]&quot; --&gt; Ziel war die Absicherung gegen UrhG-Verletzungen; haben das dann mit Karteivermerk archiviert; jetzt im OER Portal machen sie das automatisiert mit Nutzungsbedingungen; andererseits ist jetzt die Frage, wie und auf welcher Basis man diese Nutzungsbedingungen verfasst. Soll man beim ersten Login die Bedingungen akzeptieren (es stehen rechtlich bindende Sachen drinnen, obviously)?&nbsp;<br>Es haben nur Leute Zugang zum OER Repo, die Uni-Angeh&#246;rige sind (ich glaube aktuell ist auch Voraussetzung, dass sie eine Fortbildung zur OER-Erstellung absolviert haben - die Frage ist, wie lange man noch so streng sein kann)&nbsp;<br><br>An der UG k&#252;mmert sich Michael Raunig darum&nbsp;<br><br>Frage: ist eine Haftung angedacht?&nbsp;<br><br>Michael Raunig: in den UG Nutzungsbedingungen steht drinnen, dass die Objektinhaber*in (Hochlader*in) daf&#252;r haftet (?) (&#225; la: die Leute sind selbst verantwortlich)&nbsp;<br><br>Wortmeldung: es sei wichtig, das Thema UrhG im Rahmen der Fortbildung zu thematisieren; --&gt; was &#252;ber die Fortbildung hinaus passiert (wenn man die Fortbildung nicht mehr enforcen kann), k&#246;nne man nicht beeinflussen<br><br>Klagenfurt: bei der Hochladung der Ressource muss man eine Checkbox best&#228;tigen, dass die Ressource unter einer freien Ressource zur Verf&#252;gung steht und dass man das UrhRecht hat (Checkbox muss jedes Mal aktiv best&#228;tigt werden)&nbsp;<br><br>Portfolioportal: Bei erster Anmeldung bekommt man eine Mail, die man &quot;durchlesen&quot; muss und erst dann kann man ein PW setzen&nbsp;<br><br>Punkte, die wirklich wichtig sind, solle man (immer wieder) kurz durchlesen und best&#228;tigen lassen; langer Nutzungstext erschrecke; kurze Texte w&#252;rden weniger Unsicherheit ausl&#246;sen&nbsp;<br><br>Eventuell k&#246;nnte man das schon in die Dienstvertr&#228;ge in einer Klausel aufnehmen (dass man sich bereit erkl&#228;rt, OER Produktion voranzutreiben, unter diesen und jenen Bedingungen) &lt;-- Raman meint, dass man Dienstvertr&#228;ge nicht nachtr&#228;glich &#228;ndern kann (au&#223;er es ist eine generelle Rahmenvereinbarung)&nbsp;<br><br>Erfahrungen PHAIDRA: es sei grunds&#228;tzlich ein juristisches Thema (und somit inh&#228;rent nicht benutzerfreundlich ;)); Ziel, dass man als Betreiber*in des Repos nicht in eine Haftungssituation kommt; Service, den man anbietet, kann man auf zwei Ebenen betrachten: 1) Service Provider, 2) Content Provider &lt;-- w&#252;rde auch Haftung f&#252;r den Inhalt bedeuten; was passiert, wenn ein MA aufgefordert ist, ein Objekt hochzuladen? (Rolle: hochlader) &lt;-- da hat sich der UW Betriebsrat eingesetzt, dass dann nicht die Person haftet (passiert im Rahmen der Diensterf&#252;llung, nach Au&#223;en gerichtlich verantworten muss sich die juristische Person UW)&nbsp;<br><br>Raman Zusammenfassung: es m&#252;sse ein*e Jurist*in und der Betriebsrat involviert werden&nbsp;<br><br>Versto&#223; m&#252;sse man zur Anzeige bringen, Universit&#228;t m&#252;sse dann darauf hin innerhalb von gesetzl. festgelegten Fristen agieren&nbsp;<br><br>Wo zieht man die Grenze zwischen dienstlich und nicht dienstlich (Bsp.: Person erstellt als MA der Uni OERs f&#252;r privaten Zweck oder f&#252;r einen Zweck der nur am Rande was mit seinem Job zu tun hat)&nbsp;<br><br>Problemfelder: Verlage (z. B. auch Kunstb&#228;nde, weil sehr aufwendig und in kleiner Auflage produziert), gr&#246;&#223;ere Konzerne oder Unternehmen mit UrhR Anspruch<br><br>Haftung sei eines der Grundthemen bei OER, bzw. herrsche da ein verst&#228;rktes Bewusstsein f&#252;r das Thema&nbsp;<br><br>Beispiel: Uni Projekt, dort gab es nach Projektende ein Problem mit einer Grafik, die auf der Webseite verwendet wurde (und es waren keine Ansprechpersonen zur Webseite mehr an der Uni und die Webseite war gar nicht mehr eine living Webseite ;))<br><br>Beispiel: FH hat ein Bild verwendet und haben dann viel Geld zahlen m&#252;ssen; Geld wurde ein zweites Mal eingefordert, weil das Bild noch in einem Archiv lag und dann mussten sie noch ein drittes Mal zahlen, weil das Bild farblich leicht ver&#228;ndert noch an einer anderen Stelle lag (5-stellige Summe)&nbsp;<br><br>Ist man, sobald man eine inhaltliche Pr&#252;fung macht, schon ein Content Provider und haftet man dadurch?&nbsp;<br><br>...<br><br>Offtopic: Sollen auch Unterlagen von Studierenden als OER zur Verf&#252;gung gestellt werden?&nbsp;<br><br>Verweis auf Code of Conduct der Universit&#228;t (?) (noch zum Thema Studierenden)&nbsp;<br><br>Man solle nicht glauben, dass nur weil eine Person OER produziert, diese Person volles Bewusstsein &#252;ber rechtliche Bedingungen hat!&nbsp;<br><br><br><br><br><br><br><br><br>
</body>
</html>
